--¼¼ÄÜ: ̀́̉ôỢ»êÇú

Include("\\script\\skill\\skillfunctions.lua")

SKILL = {
	--¼¼ÄÜÊôĐÔ

	SKILL_LEVEL_BASE_ATTRIB	  =	--¼¼ÄÜµÈ¼¶Ïà¹Ø»ù±¾ÊôĐÔ
	{
	},

	SKILL_LEVEL_COST_ATTRIB	  =	--¼¼ÄÜµÈ¼¶Ïà¹ØÏûºÄÊôĐÔ
	{
	},

	SKILL_LEVEL_MISSLE_ATTRIB =	--¼¼ÄÜµÈ¼¶Ïà¹Ø×Óµ¯ÊôĐÔ
	{
	},

	--Ä§·¨ÊôĐÔ

	--ÊôĐÔÖµ:	ÆƠÍ¨¹¥»÷Á¦ * X + (1 + ¼¼ÄÜµÈ¼¶ * Y) * (Á¦Á¿ * A + ¸ù¹Ç * B + Éí·¨ * C + ÄÚ¹¦ * D + ¶´²́ * E)
	--			+ ÎäÆ÷Íâ¹¦¹¥»÷µă * F + Z
	--			(ÆäÖĐ,A,B,C,D,E,F,X,Y,ZÎªÉËº¦̣̉ËØ.³ưZÍâ,ÆäÓà¸÷ÉËº¦̣̉ËØÎª°Ù·Ö±ÈÊư.)

	--³É¹¦¼¸ÂÊ:	(ÊôĐÔÖµ * A + (×ÔÉíµÈ¼¶ - ¶Ô·½µÈ¼¶) * B + ¼¼ÄÜµÈ¼¶ * C) * D + X
	--			(ÆäÖĐ,A,B,C,D,XÎª¼¸ÂỆ̉ËØ.³ưXÍâ,ÆäÓà¸÷¼¸ÂỆ̉ËØÎª°Ù·Ö±ÈÊư.)

	SKILL_MAGIC_DAMAGE_ATTRIB =	--¼¼ÄÜµÈ¼¶Ïà¹ØÉËº¦Ä§·¨ÊôĐÔ
	{
	},

	SKILL_MAGIC_STATE_ATTRIB  =	--¼¼ÄÜµÈ¼¶Ïà¹Ø×´̀¬Ä§·¨ÊôĐÔ
	{
	},

	SKILL_MAGIC_IMME_ATTRIB   =	--¼¼ÄÜµÈ¼¶Ïà¹ØÁ¢¼´Ä§·¨ÊôĐÔ
	{
	},
}