-- Hoµng Kim LÖnh Bµi ver 2.0
Include("\\script\\lib\\globalfunctions.lua");
Include("\\script\\online\\zgc_public_fun.lua")
Include("\\script\\online\\viet_event\\vng_task_control.lua");

NEEDED_EXP = 200e6				
NEEDED_LEVEL = 73

-- Control BKLB
EXT_POINT_BKLB = 3		
-- §Õm sè lÇn n¹p BKLB		
BYTE_BKLB_COUNT = 1
-- Ph©n Lo¹i BKLB
BYTE_BKLB_TYPE = 2

-- Task nhËn th­ëng Vâ L©m TiÒn Bèi
TASK_FRIENDLY_AWARD_BKL = 2720
BYTE_FRIENDLY_AWARD_DAY_BKL= 1
BYTE_FRIENDLY_AWARD_MONTH_BKL = 2
BYTE_FRIENDLY_AWARD_COUNT_BKL = 3

--TASK_DIG_TIME = 2283
--TASK_DIG_DATE = 2284
---- Sö dông 31 bit ®Ó l­u l¹i index r­¬ng ®· më (1 r­¬ng chØ më 1 lÇn)
--TASK_DIG_COUNT_1 = 2285 
---- Sö dông 31 bit ®Ó l­u l¹i index r­¬ng ®· më (1 r­¬ng chØ më 1 lÇn)
--TASK_DIG_COUNT_2 = 2188 
---- Ghi l¹i tæng sè lÇn ®µo
--TASK_DIG_COUNT_ALL = 2189 

szBKLBLogHeader = "Loi Ho Lenh"
szBKLBLogAction = "nhËn th­ëng"

tb_golden_faction =
{
	"ThiÕu L©m",
	"Vâ §ang",
	"Nga My",
	"C¸i Bang",
	"§­êng M«n",
	"D­¬ng Gia",
	"Ngò §éc",
}


tb_main_city_bkl = {
	[100] = 1, 
	[150] = 1, 
	[200] = 1, 
	[300] = 1, 
	[350] = 1, 
	[400] = 1, 
	[500] = 1,
}

tb_thuongung_suite = {
	[1] = {
				{"Tèng TU §« Thèng kh«i",  {0, 103, 30029}},
				{"Tèng TU §« Thèng bµo",   {0, 100, 30029}},
				{"Tèng TU §« Thèng trang", {0, 101, 30029}},
			},
	[2] = {
				{"Liªu TU §« Thèng kh«i",  {0, 103, 30041}},
				{"Liªu TU §« Thèng bµo",   {0, 100, 30041}},
				{"Liªu TU §« Thèng trang", {0, 101, 30041}},
			},
}

tb_golden_faction_tree =
{
		[2] =  {"ThiÕu L©m tôc gia", 0, 20, 21, 23, "Kim Cang Phôc Ma T©m Ph¸p", {0,107,2,1}, "Kim Cang Phôc Ma kinh", {0,107,1,1}, "Kim Cang B¸t Nh· Kinh", {0,107,166,3}, "Kim Cang B¸t Nh· Ch©n QuyÓn ", {0, 107, 204, 3}}, 
		[3] =  {"ThiÕu L©m thiÒn t¨ng", 2, 45, 46, 0, "V« TrÇn T©m Ph¸p", {0,107,6,1}, "V« TrÇn MËt tÞch", {0,107,5,1}, "V« TrÇn Bå §Ò Kinh", {0,107,168,3}, "V« TrÇn Bå §Ò Ch©n QuyÓn", {0, 107, 206, 3}}, 
		[4] =  {"ThiÕu L©m vâ t«ng", 1, 33, 34, 0, "TiÒm Long T©m Ph¸p", {0,107,4,1}, "TiÒm Long MËt tÞch", {0,107,3,1}, "TiÒm Long TÞch DiÖt Kinh", {0,107,167,3},"TiÒm Long Tóc DiÖt Ch©n QuyÓn", {0, 107, 205, 3}}, 
		[14] =  {"Vâ §ang ®¹o gia", 8, 125, 126, 0, "HuyÒn ¶nh T©m Ph¸p", {0,107,18,1}, "HuyÒn ¶nh MËt tÞch", {0,107,17,1}, "HuyÔn ¶nh Mª Tung MËt TÞch", {0,107,174,3},"HuyÒn ¶nh Mª T«ng Ch©n QuyÓn", {0, 107, 212, 3}}, 
		[15] =  {"Vâ §ang tôc gia", 9, 147, 148, 0, "Qu©n Tö T©m Ph¸p", {0,107,20,1}, "Qu©n Tö MËt tÞch", {0,107,19,1}, "Qu©n Tö TiÖt Phong MËt TÞch", {0,107,175,3},"Qu©n Tö §íi Phong Ch©n QuyÓn", {0, 107, 213, 3}}, 
		[8] =  {"Nga My phËt gia", 4, 75, 76, 0, "Nh­ ý T©m Ph¸p", {0,107,10,1}, "Nh­ ý MËt TÞch", {0,107,9,1}, "Nh­ ý Kim §Ønh MËt TÞch", {0,107,170,3}, "Nh­ ý Kim §Ønh Ch©n QuyÓn", {0, 107, 208, 3}}, 
		[9] =  {"Nga My tôc gia", 5, 90, 91, 0, "BÝch H¶i T©m Ph¸p", {0,107,12,1}, "BÝch H¶i Phæ", {0,107,11,1}, "BÝch H¶i TuyÖt ¢m Phæ", {0,107,171,3}, "BÝch H¶i TuyÖt ¢m Ch©n QuyÓn", {0, 107, 209, 3}}, 
		[11] =  {"C¸i Bang tÜnh y", 6, 103, 104, 0, "Hçn §én T©m Ph¸p", {0,107,14,1}, "Hçn §én MËt tÞch", {0,107,13,1}, "Hçn §én TrÊn Nh¹c MËt TÞch", {0,107,172,3}, "Hçn §én TrÊn Nh¹c Ch©n QuyÓn", {0, 107, 210, 3}}, 
		[12] =  {"C¸i Bang « y", 7, 114, 115, 0, "Quý Thiªn T©m Ph¸p", {0,107,16,1}, "Quý Thiªn MËt tÞch", {0,107,15,1}, "Quü Thiªn Du Long MËt TÞch", {0,107,173,3}, "Quú Thiªn Du Long Ch©n QuyÓn", {0, 107, 211, 3}}, 
		[6] =  {"§­êng M«n", 3, 58, 60, 0, "Thiªn La T©m Ph¸p", {0,107,8,1}, "Thiªn La MËt TÞch", {0,107,7,1}, "Thiªn La Liªn Ch©u Lôc", {0,107,169,3}, "Thiªn La Liªn Ch©u Ch©n QuyÓn", {0, 107, 207, 3}}, 
		[17] =  {"D­¬ng Gia th­¬ng", 10, 720, 0, 0, "TrÊn Qu©n T©m Ph¸p", {0,107,22,1}, "TrÊn Qu©n MËt tÞch", {0,107,21,1}, "TrÊn Qu©n Phi Long Th­¬ng Phæ", {0,107,176,3}, "TrÊn Qu©n Phi Long Th­¬ng Ch©n QuyÓn", {0, 107, 214, 3}}, 
		[18] =  {"D­¬ng Gia cung", 11, 733, 0, 0, "Xuyªn V©n T©m Ph¸p", {0,107,24,1}, "Xuyªn V©n MËt tÞch", {0,107,23,1}, "Xuyªn V©n L¹c Hång MËt TÞch", {0,107,177,3}, "Xuyªn V©n L¹c Hång Ch©n QuyÓn", {0, 107, 215, 3}}, 
		[20] = {"Ngò §éc hiÖp ®éc", 12, 13, 364, 365, "U Minh T©m Ph¸p", {0,107,26,1}, "U Minh Quû Lôc", {0,107,25,1}, "U Minh Phong Ma Lôc", {0,107,178,3}, "HuyÒn Minh Phong Ma Ch©n QuyÓn", {0, 107, 216, 3}}, 
		[21] = {"Ngò §éc tµ ®éc", 13, 14, 347, 351, "Linh Cæ T©m Ph¸p", {0,107,28,1}, "Linh Cæ MËt tÞch", {0,107,27,1}, "Linh Cæ HuyÔn Tµ Lôc", {0,107,179,3}, "Linh Cæ HuyÒn Tµ Ch©n QuyÓn", {0, 107, 217, 3}}, 
		[23] = {"1", "2", "3", "4", "5", "6", "7", "8", "9", "Cöu Thiªn L«i Phong QuyÕt", {0,107,198,3}, "Cöu Thiªn L«i Phong Ch©n QuyÓn", {0,107,218,3}},
		[29] = {"1", "2", "3", "4", "5", "6", "7", "8", "9", "Hång TrÇn Tóy Méng Phæ", {0,107,202,3}, "Hång TrÇn Tóy Méng Ch©n QuyÓn", {0,107,222,3}},
		[30] = {"1", "2", "3", "4", "5", "6", "7", "8", "9", "Phong Hoa Thiªn DiÖp Phæ", {0,107,203,3}, "Phong Hoa Thiªn DiÖp Ch©n QuyÓn", {0,107,223,3}},
}
tb_VK_SuMon_DB =
{	
		[2] = {"VK S­ M«n ThiÕu L©m Tôc", {{{0,3,231, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,5,231, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}, {{0,3,232, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,5,232, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}}},
}
tb_VK_SuMon0 =
{	
		[2] = {"VK S­ M«n ThiÕu L©m Tôc", {{0,3,231, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,3,232, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}},
		[3] = {"VK S­ M«n ThiÕu L©m ThiÒn", {{0,8,331, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,8,332, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}},
		[4] = {"VK S­ M«n ThiÕu L©m Vâ", {{0,0,431, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,0,432, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}},
		[6] = {"VK S­ M«n  §­êng M«n", {{0,1,631, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,1,632, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,1,633, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,1,634, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}},
		[8] = {"VK S­ M«n  Nga My PhËt", {" ", " ", {0,2,831, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,2,832, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}},
		[9] = {"VK S­ M«n Nga My Tôc", {" ", " ", {0,10,931, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,10,932, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}},
		[11] = {"VK S­ M«n C¸i Bang TÞnh", {{0,0,1131, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,0,1132, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,0,1133, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,0,1134, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}},
		[12] = {"VK S­ M«n C¸i Bang ¤", {{0,5,1231, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,5,1232, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,5,1233, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,5,1234, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}},
		[14] = {"VK S­ M«n Vâ §ang §¹o", {{0,2,1431, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,2,1432, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,2,1433, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,2,1434, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}},
		[15] = {"VK S­ M«n Vâ §ang Tôc", {{0,9,1531, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,9,1532, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,9,1533, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,9,1534, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}},
		[17] = {"VK S­ M«n D­¬ng M«n Th­¬ng", {{0,6,1731, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,6,1732, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,6,1733, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,6,1734, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}},
		[18] = {"VK S­ M«n D­¬ng M«n Cung", {{0,4,1831, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,4,1832, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,4,1833, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,4,1834, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}},
		[20] = {"VK S­ M«n HiÖp §éc", {{0,7,2031, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,7,2032, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,7,2033, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,7,2034, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}},
		[21] = {"VK S­ M«n Tµ §éc", {{0,11,2131, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,11,2132, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,11,2133, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, {0,11,2134, 1,1,-1,-1,-1,-1,-1,-1,-1,0}}},	
}
tb_VK_SuMon =
{	
		[2] = {"VK S­ M«n ThiÕu L©m Tôc", {{0,3,231, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,3,232, 1,1,-1,-1,-1,-1,-1,-1,-1,8}}},
		[3] = {"VK S­ M«n ThiÕu L©m ThiÒn", {{0,8,331, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,8,332, 1,1,-1,-1,-1,-1,-1,-1,-1,8}}},
		[4] = {"VK S­ M«n ThiÕu L©m Vâ", {{0,0,431, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,0,432, 1,1,-1,-1,-1,-1,-1,-1,-1,8}}},
		[6] = {"VK S­ M«n  §­êng M«n", {{0,1,631, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,1,632, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,1,633, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,1,634, 1,1,-1,-1,-1,-1,-1,-1,-1,8}}},
		[8] = {"VK S­ M«n  Nga My PhËt", {" ", " ", {0,2,831, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,2,832, 1,1,-1,-1,-1,-1,-1,-1,-1,8}}},
		[9] = {"VK S­ M«n Nga My Tôc", {" ", " ", {0,10,931, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,10,932, 1,1,-1,-1,-1,-1,-1,-1,-1,8}}},
		[11] = {"VK S­ M«n C¸i Bang TÞnh", {{0,0,1131, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,0,1132, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,0,1133, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,0,1134, 1,1,-1,-1,-1,-1,-1,-1,-1,8}}},
		[12] = {"VK S­ M«n C¸i Bang ¤", {{0,5,1231, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,5,1232, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,5,1233, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,5,1234, 1,1,-1,-1,-1,-1,-1,-1,-1,8}}},
		[14] = {"VK S­ M«n Vâ §ang §¹o", {{0,2,1431, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,2,1432, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,2,1433, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,2,1434, 1,1,-1,-1,-1,-1,-1,-1,-1,8}}},
		[15] = {"VK S­ M«n Vâ §ang Tôc", {{0,9,1531, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,9,1532, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,9,1533, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,9,1534, 1,1,-1,-1,-1,-1,-1,-1,-1,9}}},
		[17] = {"VK S­ M«n D­¬ng M«n Th­¬ng", {{0,6,1731, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,6,1732, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,6,1733, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,6,1734, 1,1,-1,-1,-1,-1,-1,-1,-1,8}}},
		[18] = {"VK S­ M«n D­¬ng M«n Cung", {{0,4,1831, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,4,1832, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,4,1833, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,4,1834, 1,1,-1,-1,-1,-1,-1,-1,-1,8}}},
		[20] = {"VK S­ M«n HiÖp §éc", {{0,7,2031, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,7,2032, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,7,2033, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,7,2034, 1,1,-1,-1,-1,-1,-1,-1,-1,8}}},
		[21] = {"VK S­ M«n Tµ §éc", {{0,11,2131, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,11,2132, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,11,2133, 1,1,-1,-1,-1,-1,-1,-1,-1,8}, {0,11,2134, 1,1,-1,-1,-1,-1,-1,-1,-1,8}}},	
}
tb_golden_ngocboi1 = {
				[2]  = {"Tö Viªn ChiÕn",{0,102,8851,1,1,-1,-1,-1,-1,-1,-1}},
				[3]  = {"Tö Viªn ChiÕn",{0,102,8853,1,1,-1,-1,-1,-1,-1,-1}},
				[4]  = {"Tö Viªn ChiÕn",{0,102,8855,1,1,-1,-1,-1,-1,-1,-1}},
				[6]  = {"Tö Viªn ChiÕn",{0,102,8857,1,1,-1,-1,-1,-1,-1,-1}},
				[8]  = {"Tö Viªn ChiÕn",{0,102,8859,1,1,-1,-1,-1,-1,-1,-1}},
				[9]  = {"Tö Viªn ChiÕn",{0,102,8861,1,1,-1,-1,-1,-1,-1,-1}},
				[11] = {"Tö Viªn ChiÕn",{0,102,8863,1,1,-1,-1,-1,-1,-1,-1}},
				[12] = {"Tö Viªn ChiÕn",{0,102,8865,1,1,-1,-1,-1,-1,-1,-1}},
				[14] = {"Tö Viªn ChiÕn",{0,102,8867,1,1,-1,-1,-1,-1,-1,-1}},
				[15] = {"Tö Viªn ChiÕn",{0,102,8869,1,1,-1,-1,-1,-1,-1,-1}},
				[17] = {"Tö Viªn ChiÕn",{0,102,8871,1,1,-1,-1,-1,-1,-1,-1}},
				[18] = {"Tö Viªn ChiÕn",{0,102,8873,1,1,-1,-1,-1,-1,-1,-1}},
				[20] = {"Tö Viªn ChiÕn",{0,102,8875,1,1,-1,-1,-1,-1,-1,-1}},
				[21] = {"Tö Viªn ChiÕn",{0,102,8877,1,1,-1,-1,-1,-1,-1,-1}},
}

tb_golden_award_BKL = 
{
				[74] = {	3000, 	4000, 	50000, 1, 0, 0, 0, 0},
				[75] = {	3000, 	4000, 	50000, 2, 0, 0, 0, 0},
				[76] = {	3000, 	4000, 	50000, 3, 0, 0, 0, 0},
				[77] = {	5000, 	5000, 	50000, 4, 0, 0, 0, 0},
				[78] = {	5000, 	5000, 	55000, 5, 0, 0, 0, 0},
				[79] = {	5000, 	5000, 	55000, 6, 0, 0, 0, 0},
				[80] = {	6000, 	6000, 	60000, 7, 0, 0, 0, 0},
				[81] = {	7000, 	7000, 	65000, 8, 15000000, 300, 300, 0},
				[82] = {	8000, 	8000, 	70000, 9, 0, 0, 0, 0},
				[83] = {	9000, 	9000, 	75000, 10, 0, 0, 0,0},
				[84] = {	10000, 	10000, 	80000, 11, 0, 0, 0,0},
				[85] = {	10000, 	10000, 	80000, 12, 0, 0, 0,0},
				[86] = {	10500, 	10500, 	81000, 13, 20000000, 300, 300,0},
				[87] = {	11000, 	11000, 	82000, 14, 0, 0, 0,0},
				[88] = {	12000, 	12000, 	100000, 15, 30000000, 300, 300, 0},
				[89] = {	13500, 	13500, 	100000, 16, 0, 0, 0, 0},
				[90] = {	15000, 	15000, 	100000, 17, 50000000, 300, 300, 0},
				[91] = {	15500, 	15500, 	150000, 18, 0, 0, 0, 0},
				[92] = {	15500, 	15500, 	150000, 19, 0, 0, 0, 0},
				[93] = {	15500, 	15500, 	175000, 20, 100000000, 1000, 1000, 1000},
				[94] = {	15500, 	15500, 	200000, 21, 100000000, 1000, 1000, 1000},
				[95] = {	18000, 	18000, 	250000, 22, 100000000, 1000, 1000, 1000},
				[96] = {	20000, 	20000, 	275000, 23, 100000000, 1000, 1000, 1000},
				[97] = {	21000, 	21000, 	300000, 24, 100000000, 1000, 1000, 1000},
				[98] = {	21000, 	21000, 	320000, 25, 100000000, 1000, 1000, 1000},
				[99] = {	26000, 	26000, 	390000, 26, 2000000000, 0, 0, 0},
				[696] = {30000, 	30000, 	700000, 27, 3000000000, 0, 0, 0},
}

tb_golden_digging =
{
				[1] = {3000, 	5000, 	50000},
				[2] = {5000, 	7000, 	60000},
				[3] = {7500, 	8500, 	70000},
				[4] = {10000, 	10000, 	80000},
}

tb_hunting_treasure =
{
				[1] = {50000,		3000,	5000,	73,  79,	1},
				[2] = {60000,		5000,	7000,	80,  84,	8},
				[3] = {70000,		7500,	8500,	85,  89,	12},
				[4] = {80000,		10000,	10000,	90,  99,	16},
}

tb_golden_jew_chien = {
				[2]  = {"Tö Viªn ChiÕn",{0,102,8851,1,1,-1,-1,-1,-1,-1,-1}},
				[3]  = {"Tö Viªn ChiÕn",{0,102,8853,1,1,-1,-1,-1,-1,-1,-1}},
				[4]  = {"Tö Viªn ChiÕn",{0,102,8855,1,1,-1,-1,-1,-1,-1,-1}},
				[6]  = {"Tö Viªn ChiÕn",{0,102,8857,1,1,-1,-1,-1,-1,-1,-1}},
				[8]  = {"Tö Viªn ChiÕn",{0,102,8859,1,1,-1,-1,-1,-1,-1,-1}},
				[9]  = {"Tö Viªn ChiÕn",{0,102,8861,1,1,-1,-1,-1,-1,-1,-1}},
				[11] = {"Tö Viªn ChiÕn",{0,102,8863,1,1,-1,-1,-1,-1,-1,-1}},
				[12] = {"Tö Viªn ChiÕn",{0,102,8865,1,1,-1,-1,-1,-1,-1,-1}},
				[14] = {"Tö Viªn ChiÕn",{0,102,8867,1,1,-1,-1,-1,-1,-1,-1}},
				[15] = {"Tö Viªn ChiÕn",{0,102,8869,1,1,-1,-1,-1,-1,-1,-1}},
				[17] = {"Tö Viªn ChiÕn",{0,102,8871,1,1,-1,-1,-1,-1,-1,-1}},
				[18] = {"Tö Viªn ChiÕn",{0,102,8873,1,1,-1,-1,-1,-1,-1,-1}},
				[20] = {"Tö Viªn ChiÕn",{0,102,8875,1,1,-1,-1,-1,-1,-1,-1}},
				[21] = {"Tö Viªn ChiÕn",{0,102,8877,1,1,-1,-1,-1,-1,-1,-1}},
}

tb_golden_jew_dau = {
				[2]  = {"Tö Viªn §Êu",{0,102,8852,1,1,-1,-1,-1,-1,-1,-1}},
				[3]  = {"Tö Viªn §Êu",{0,102,8854,1,1,-1,-1,-1,-1,-1,-1}},
				[4]  = {"Tö Viªn §Êu",{0,102,8856,1,1,-1,-1,-1,-1,-1,-1}},
				[6]  = {"Tö Viªn §Êu",{0,102,8858,1,1,-1,-1,-1,-1,-1,-1}},
				[8]  = {"Tö Viªn §Êu",{0,102,8860,1,1,-1,-1,-1,-1,-1,-1}},
				[9]  = {"Tö Viªn §Êu",{0,102,8862,1,1,-1,-1,-1,-1,-1,-1}},
				[11] = {"Tö Viªn §Êu",{0,102,8864,1,1,-1,-1,-1,-1,-1,-1}},
				[12] = {"Tö Viªn §Êu",{0,102,8866,1,1,-1,-1,-1,-1,-1,-1}},
				[14] = {"Tö Viªn §Êu",{0,102,8868,1,1,-1,-1,-1,-1,-1,-1}},
				[15] = {"Tö Viªn §Êu",{0,102,8870,1,1,-1,-1,-1,-1,-1,-1}},
				[17] = {"Tö Viªn §Êu",{0,102,8872,1,1,-1,-1,-1,-1,-1,-1}},
				[18] = {"Tö Viªn §Êu",{0,102,8874,1,1,-1,-1,-1,-1,-1,-1}},
				[20] = {"Tö Viªn §Êu",{0,102,8876,1,1,-1,-1,-1,-1,-1,-1}},
				[21] = {"Tö Viªn §Êu",{0,102,8878,1,1,-1,-1,-1,-1,-1,-1}},
}

-- golden weekday award
tb_golden_material_goldenday_BKL = {
				[7] = {"Gç Qu©n Dông", {2,0,308}, 720, 1, 1, 19},
				[8] = {"Qu©n C«ng Ch­¬ng", {2,1,9999}, 720, 1, 2, 47},
				[9] = {"B¸t Nh· nhá", {2,0,504}, 720, 2, 4, 59},				
}

-- 1 item, 2 table
-- must identify main table below the sub table
tb_golden_jew_BKL = {
				[1] = {3, "Thiªn Chi TK Kim Ên", 60, {0, 102, 30002,1,1,-1,-1,-1,-1,-1,-1}},
				[2] = {3, "Thiªn Chi TK Kú Th¹ch", 200, {0, 102, 30001,1,1,-1,-1,-1,-1,-1,-1}},				
				[3] = {3, "Thiªn Chi TK B¶o Ch©u", 200, {0, 102, 30000,1,1,-1,-1,-1,-1,-1,-1}},
				[4] = {1, "§«ng Ph­¬ng Long Ch©u", 100, {0, 102, 24,1,1,-1,-1,-1,-1,-1,-1}},			
				[5] = {2, tb_golden_jew_chien, 220, {0, 102, 8851,1,1,-1,-1,-1,-1,-1,-1}},		
				[6] = {2, tb_golden_jew_dau, 220, {0, 102, 8852,1,1,-1,-1,-1,-1,-1,-1}},		
			--	[7] = {1, "Ngäc béi 1 s­ m«n bé 4", 250, {0,102,15,1,1,2,24,3,14,0,0}},		
			--	[8] = {1, "Ngäc béi 2 s­ m«n bé 4", 250, {0,102,20,1,1,2,24,3,14,0,0}},
}
--------------------------------------------------------------------------------------

tb_golden_weapon_bpy_low = {
				[2]  = {"Ph¸ Yªn ®ao", {0, 3, 6001, 1,1,-1,-1,-1,-1,-1,-1}},
				[3]  = {"Phï Yªn tr­îng",{0,8,6003, 1,1,-1,-1,-1,-1,-1,-1}},
				[4]  = {"Hµm Yªn thñ",{0,0,6004, 1,1,-1,-1,-1,-1,-1,-1}},
				[6]  = {"Tµng Yªn ch©m",{0,1,6005, 1,1,-1,-1,-1,-1,-1,-1}},
				[8]  = {"Phi Yªn kiÕm",{0,2,6006, 1,1,-1,-1,-1,-1,-1,-1}},
				[9]  = {"VËn Yªn cÇm",{0,10,6007, 1,1,-1,-1,-1,-1,-1,-1}},
				[11] = {"V©n Yªn thñ",{0,0,6008, 1,1,-1,-1,-1,-1,-1,-1}},
				[12] = {"L­u Yªn c«n",{0,5,6009, 1,1,-1,-1,-1,-1,-1,-1}},
				[14] = {"HuyÒn Yªn kiÕm",{0,2,6010, 1,1,-1,-1,-1,-1,-1,-1}},
				[15] = {"Vò Yªn bót",{0,9,6011, 1,1,-1,-1,-1,-1,-1,-1}},
				[17] = {"Hµ Tiªm Th­¬ng",{0,6,6012, 1,1,-1,-1,-1,-1,-1,-1}},
				[18] = {"Hµnh Yªn Cung",{0,4,6013, 1,1,-1,-1,-1,-1,-1,-1}},
				[20] = {"Träc Yªn nhÉn",{0,7,6014, 1,1,-1,-1,-1,-1,-1,-1}},
				[21] = {"Yªu Yªn tr¶o",{0,11,6015, 1,1,-1,-1,-1,-1,-1,-1}},
};

tb_golden_weapon_bpy_med = {
				[2]  = {"Ph¸ Yªn ®ao", {0, 3, 6001, 1,1,6,85,7,263,7,264}},
				[3]  = {"Phï Yªn tr­îng",{0,8,6003, 1,1,6,86,7,267,7,263}},
				[4]  = {"Hµm Yªn thñ",{0,0,6004, 1,1,6,86,7,267,7,263}},
				[6]  = {"Tµng Yªn ch©m",{0,1,6005, 1,1,4,281,7,265,7,264}},
				[8]  = {"Phi Yªn kiÕm",{0,2,6006, 1,1,6,86,4,292,4,293}},
				[9]  = {"VËn Yªn cÇm",{0,10,6007, 1,1,2,27,7,266,7,265}},
				[11] = {"V©n Yªn thñ",{0,0,6008, 1,1,6,85,7,264,7,263}},
				[12] = {"L­u Yªn c«n",{0,5,6009, 1,1,3,268,7,265,7,266}},
				[14] = {"HuyÒn Yªn kiÕm",{0,2,6010, 1,1,6,86,7,267,7,266}},
				[15] = {"Vò Yªn bót",{0,9,6011, 1,1,3,268,7,266,7,265}},
				[17] = {"Hµ Tiªm Th­¬ng",{0,6,6012, 1,1,6,85,7,264,7,263}},
				[18] = {"Hµnh Yªn Cung",{0,4,6013, 1,1,3,268,7,265,7,264}},
				[20] = {"Träc Yªn nhÉn",{0,7,6014, 1,1,4,281,7,265,7,264}},
				[21] = {"Yªu Yªn tr¶o",{0,11,6015, 1,1,5,285,7,266,7,267}},
};

tb_golden_weapon_tq_med = {
				[2]  = {"Tö Quang To¸i Vò §ao",{0,3,8851, 1,1,-1,-1,-1,-1,-1,-1}},
				[3]  = {"Tö Quang Cöu Nh­ Tr­îng",{0,8,8853, 1,1,-1,-1,-1,-1,-1,-1}},
				[4]  = {"Tö Quang H¹o Nhiªn Thñ",{0,0,8854, 1,1,-1,-1,-1,-1,-1,-1}},
				[6]  = {"Tö Quang V« H×nh Ch©m",{0,1,8855, 1,1,-1,-1,-1,-1,-1,-1}},
				[8]  = {"Tö Quang Tö Tinh KiÕm",{0,2,8856, 1,1,-1,-1,-1,-1,-1,-1}},
				[9]  = {"Tö Quang Phông Hoµng CÇm",{0,10,8857, 1,1,-1,-1,-1,-1,-1,-1}},
				[11] = {"Tö Quang Ngò Nh¹c Thñ",{0,0,8858, 1,1,-1,-1,-1,-1,-1,-1}},
				[12] = {"Tö Quang Ph¸ Thiªn C«n",{0,5,8859, 1,1,-1,-1,-1,-1,-1,-1}},
				[14] = {"Tö Quang Hång Qu©n KiÕm",{0,2,8860, 1,1,-1,-1,-1,-1,-1,-1}},
				[15] = {"Tö Quang Sinh Tö Bót",{0,9,8861, 1,1,-1,-1,-1,-1,-1,-1}},
				[17] = {"Tö Quang Ph¸ Qu©n Th­¬ng",{0,6,8862, 1,1,-1,-1,-1,-1,-1,-1}},
				[18] = {"Tö Quang Khai Thiªn Cung",{0,4,8863, 1,1,-1,-1,-1,-1,-1,-1}},
				[20] = {"Tö Quang ¢m D­¬ng NhÉn",{0,7,8864, 1,1,-1,-1,-1,-1,-1,-1}},
				[21] = {"Tö Quang U Minh Tr¶o",{0,11,8865, 1,1,-1,-1,-1,-1,-1,-1}},
};

-- tªn item thu thËp, item ID, h¹t gièng, vµng, mÆt n¹ s¸t thñ ®­êng, tr¸i c©y
tb_everyday_award_BKL = {
	[1] = {	-- Th¸i dÞch, h¹t gièng, yÕu quyÕt, vµng, tr¸i c©y (cét 7)
				[7] = {1, 1, 1, 10, "Dõa", {2,1,30167,1}, 1},	
				[8] = {1, 5, 5, 60, "Dõa", {2,1,30167,4}, 5},	
				[9] = {3, 6, 8, 80, "Dõa", {2,1,30167,6}, 8},
	},
	[2] = {
				[7] = {1, 1, 1, 20, "M·ng cÇu", {2,1,30179,1}, 1},	
				[8] = {2, 4, 4, 66, "M·ng cÇu", {2,1,30179,2}, 4},	
				[9] = {3, 5, 6, 79, "M·ng cÇu", {2,1,30179,4}, 6},
	},
}
tb_everyday_fruit_BKL = {
				[0] = {30164,"Nh·n"},
				[1] = {30165,"Ch«m Ch«m"},
				[2] = {30166,"Cam"},
				[3] = {30167,"Dõa"},
				[4] = {30168,"M¨ng côt"},
				[5] = {30169,"B­ëi"},
				[6] = {30170,"D©u"},
				[7] = {30171,"Chuèi"},
				[8] = {30172,"Xoµi"},
				[9] = {30173,"§µo"},
				[10] = {30174,"MËn"},
				[11] = {30175,"V¶i"},
				[12] = {30176,"T¸o"},
				[13] = {30177,"B¬"},
				[14] = {30178,"§u §ñ"},
				[15] = {30179,"M·ng CÇu"},
				[16] = {30180,"Khãm"},
				[17] = {30181,"Lª"},
				[18] = {30182,"Bßn Bon"},
				[19] = {30183,"KhÕ"},
}
-- Thªm b¶ng tu ch©n yÕu quyÕt 
tb_everyday_award_TCYQ_BKL = {
	[1] = {
				[7] = {2,0,554,1,4},	
				[8] = {2,0,554,4,4},
				[9] = {2,0,554,6,4},
	},
	
	[2] = {
				[7] = {2,0,554,1,4},	
				[8] = {2,0,554,2,4},
				[9] = {2,0,554,4,4},
	},
}

tb_golden_skillbag = {
				[2] = {"Tói bÝ kiÕp ThiÕu L©m", {2, 0, 607, 3, 4}},
				[3] = {"Tói bÝ kiÕp ThiÕu L©m", {2, 0, 607, 3, 4}},
				[4] = {"Tói bÝ kiÕp ThiÕu L©m", {2, 0, 607, 3, 4}},
				[6] = {"Tói bÝ kiÕp §­êng M«n", {2, 0, 608, 3, 4}},
				[8] = {"Tói bÝ kiÕp Nga My", {2, 0, 609, 3, 4}},
				[9] = {"Tói bÝ kiÕp Nga My", {2, 0, 609, 3, 4}},
				[11] = {"Tói bÝ kiÕp C¸i Bang", {2, 0, 610, 3, 4}},
				[12] = {"Tói bÝ kiÕp C¸i Bang", {2, 0, 610, 3, 4}},
				[14] = {"Tói bÝ kiÕp Vâ §ang", {2, 0, 611, 3, 4}},
				[15] = {"Tói bÝ kiÕp Vâ §ang", {2, 0, 611, 3, 4}},
				[17] = {"Tói bÝ kiÕp D­¬ng M«n", {2, 0, 612, 3, 4}},
				[18] = {"Tói bÝ kiÕp D­¬ng M«n", {2, 0, 612, 3, 4}},
				[20] = {"Tói bÝ kiÕp Ngò §éc", {2, 0, 613, 3, 4}},
				[21] = {"Tói bÝ kiÕp Ngò §éc", {2, 0, 613, 3, 4}}
}

tb_golden_book_high = {
				[2] = {"DÞch C©n Kinh-th­îng", {2, 1, 916, 1}},
				[4] = {"Nh­ Lai ThÇn Ch­ëng-th­îng", {2, 1, 919, 1}},
				[3] = {"TÈy Tñy Kinh-th­îng", {2, 1, 922, 1}},
				[6] = {"HÊp Tinh TrËn-th­îng", {2, 1, 925, 1}},
				[8] = {"V¹n T­íng ThÇn C«ng-th­îng", {2, 1, 928, 1}},
				[9] = {"Thiªn ¢m TrÊn Hån Khóc-th­îng", {2, 1, 931, 1}},
				[11] = {"Gi¸ng Long ThËp B¸t Ch­ëng-th­îng", {2, 1, 934, 1}},
				[12] = {"§¶ CÈu C«n TrËn-th­îng", {2, 1, 937, 1}},
				[14] = {"V« Th­îng Th¸i Cùc KiÕm-th­îng", {2, 1, 940, 1}},
				[15] = {"Th¸i Cùc ThÇn C«ng-th­îng", {2, 1, 943, 1}},
				[17] = {"Liªn Hoµn Toµn Long Th­¬ng-th­îng", {2, 1, 946, 1}},
				[18] = {"B¸ V­¬ng T­êng Phông TiÔn-th­îng", {2, 1, 949, 1}},
				[20] = {"V« Thiªn Ma C«ng-th­îng", {2, 1, 955, 1}},
				[21] = {"V« ¶nh Ma Cæ-th­îng", {2, 1, 952, 1}},
}

tb_golden_book_med = {
				[2] = {"DÞch C©n Kinh-trung", {2, 1, 917, 1}},			
				[4] = {"Nh­ Lai ThÇn Ch­ëng-trung", {2, 1, 920, 1}},			
				[3] = {"TÈy Tñy Kinh-trung", {2, 1, 923, 1}},			
				[6] = {"HÊp Tinh TrËn-trung", {2, 1, 926, 1}},			
				[8] = {"V¹n T­íng ThÇn C«ng-trung", {2, 1, 929, 1}},			
				[9] = {"Thiªn ¢m TrÊn Hån Khóc-trung", {2, 1, 932, 1}},			
				[11] = {"Gi¸ng Long ThËp B¸t Ch­ëng-trung", {2, 1, 935, 1}},			
				[12] = {"§¶ CÈu C«n TrËn-trung", {2, 1, 938, 1}},			
				[14] = {"V« Th­îng Th¸i Cùc KiÕm-trung", {2, 1, 941, 1}},			
				[15] = {"Th¸i Cùc ThÇn C«ng-trung", {2, 1, 944, 1}},			
				[17] = {"Liªn Hoµn Toµn Long Th­¬ng-trung", {2, 1, 947, 1}},			
				[18] = {"B¸ V­¬ng T­êng Phông TiÔn-trung", {2, 1, 950, 1}},			
				[20] = {"V« Thiªn Ma C«ng-trung", {2, 1, 956, 1}}, 
				[21] = {"V« ¶nh Ma Cæ-trung", {2, 1, 953, 1}},
}

tb_golden_book_all = {
				[2] = {"DÞch C©n Kinh", {0, 112, 101, 1}},		
				[4] = {"Nh­ Lai ThÇn Ch­ëng", {0, 112, 102, 1}},		
				[3] = {"TÈy Tñy Kinh", {0, 112, 103, 1}},		
				[6] = {"HÊp Tinh TrËn", {0, 112, 104, 1}},		
				[8] = {"V¹n T­íng ThÇn C«ng", {0, 112, 105, 1}},		
				[9] = {"Thiªn ¢m TrÊn Hån Khóc", {0, 112, 106, 1}},		
				[11] = {"Gi¸ng Long ThËp B¸t Ch­ëng", {0, 112, 107, 1}},		
				[12] = {"§¶ CÈu C«n TrËn", {0, 112, 108, 1}},		
				[14] = {"V« Th­îng Th¸i Cùc KiÕm", {0, 112, 109, 1}},		
				[15] = {"Th¸i Cùc ThÇn C«ng", {0, 112, 110, 1}},		
				[17] = {"Liªn Hoµn Toµn Long Th­¬ng", {0, 112, 111, 1}},		
				[18] = {"B¸ V­¬ng T­êng Phông TiÔn", {0, 112, 112, 1}},		
				[20] = {"V« Thiªn Ma C«ng", {0, 112, 113, 1}},		
				[21] = {"V« ¶nh Ma Cæ", {0, 112, 114, 1}},		
				[23] = {"Phong L«i Ch©u", {0,112,192,1}},
				[29] = {"Phông Minh Phæ", {0,112,196,1}},
				[30] = {"Hoa Tiªn T©m Kinh", {0,112,197,1}},				
}
tb_golden_book_gaojimiji_faction = {
				[2] = {"Kim Cang B¸t Nh· Ch©n QuyÓn ", {0, 107, 204, 1}},		
				[4] = {"TiÒm Long Tóc DiÖt Ch©n QuyÓn", {0, 107, 205, 1}},
				[3] = {"V« TrÇn Bå §Ò Ch©n QuyÓn", {0, 107, 206, 1}},		
				[6] = {"Thiªn La Liªn Ch©u Ch©n QuyÓn", {0, 107, 207,1 }},		
				[8] = {"Nh­ ý Kim §Ønh Ch©n QuyÓn", {0, 107, 208, 1}},		
				[9] = {"BÝch H¶i TuyÖt ¢m Ch©n QuyÓn", {0, 107, 209, 1}},		
				[11] = {"Hçn §én TrÊn Nh¹c Ch©n QuyÓn", {0, 107, 210, 1}},		
				[12] = {"Quú Thiªn Du Long Ch©n QuyÓn", {0, 107, 211, 1}},		
				[14] = {"HuyÒn ¶nh Mª T«ng Ch©n QuyÓn", {0, 107, 212, 1}},		
				[15] = {"Qu©n Tö §íi Phong Ch©n QuyÓn", {0, 107, 213, 1}},		
				[17] = {"TrÊn Qu©n Phi Long Th­¬ng Ch©n QuyÓn", {0, 107, 214, 1}},		
				[18] = {"Xuyªn V©n L¹c Hång Ch©n QuyÓn", {0, 107, 215, 1}},		
				[20] = {"HuyÒn Minh Phong Ma Ch©n QuyÓn", {0, 107, 216, 1}},		
				[21] = {"Linh Cæ HuyÒn Tµ Ch©n QuyÓn", {0, 107, 217, 1}},		
				[23] = {"Cöu Thiªn Phong L«i Ch©n QuyÓn", {0, 107, 218, 1}},		
				[29] = {"Hång TrÇn Tóy Méng Ch©n QuyÓn", {0, 107, 222, 1}},		
				[30] = {"Phong Hoa Thiªn DiÖp Ch©n QuyÓn", {0, 107, 223, 1}},		
}
-- MËt tÞch cao cÊp 70
tb_golden_book_gaojimiji = {
	{1, 888, "Kim Cang B¸t Nh· Ch©n QuyÓn ", {0, 107, 204, 1}, 0},
	{1, 568, "TiÒm Long Tóc DiÖt Ch©n QuyÓn", {0, 107, 205, 1}, 0},
	{1, 714, "V« TrÇn Bå §Ò Ch©n QuyÓn", {0, 107, 206, 1}, 0},
	{1, 888, "Thiªn La Liªn Ch©u Ch©n QuyÓn", {0, 107, 207, 1}, 0},
	{1, 568, "Nh­ ý Kim §Ønh Ch©n QuyÓn", {0, 107, 208, 1}, 0},
	{1, 568, "BÝch H¶i TuyÖt ¢m Ch©n QuyÓn", {0, 107, 209, 1}, 0},
	{1, 888, "Hçn §én TrÊn Nh¹c Ch©n QuyÓn", {0, 107, 210, 1}, 0},
	{1, 668, "Quú Thiªn Du Long Ch©n QuyÓn", {0, 107, 211, 1}, 0},
	{1, 668, "HuyÒn ¶nh Mª T«ng Ch©n QuyÓn", {0, 107, 212, 1}, 0},
	{1, 714, "Qu©n Tö §íi Phong Ch©n QuyÓn", {0, 107, 213, 1}, 0},
	{1, 668, "TrÊn Qu©n Phi Long Th­¬ng Ch©n QuyÓn", {0, 107, 214, 1}, 0},
	{1, 668, "Xuyªn V©n L¹c Hång Ch©n QuyÓn", {0, 107, 215, 1}, 0},
	{1, 888, "HuyÒn Minh Phong Ma Ch©n QuyÓn", {0, 107, 216, 1}, 0},
	{1, 644, "Linh Cæ HuyÒn Tµ Ch©n QuyÓn", {0, 107, 217, 1}, 0},
	{1, 0, "Cöu Thiªn Phong L«i Ch©n QuyÓn", {0, 107, 218, 1}, 0},
	{1, 0, "Hång TrÇn Tóy Méng Ch©n QuyÓn", {0, 107, 222, 1}, 0},
	{1, 0, "Phong Hoa Thiªn DiÖp Ch©n QuyÓn", {0, 107, 223, 1}, 0},	
}

-- Vò KhÝ ViÖt Yªn 
tb_golden_vy_weapon = 
{
	[2] = {"ViÖt Yªn Phi Tinh §ao",{0,3,30001,1,1,-1,-1,-1,-1,-1,-1}},-- ThiÕu l©m tôc gia
	[3] = {"ViÖt Yªn Phi Tinh Tr­îng",{0,8,30003,1,1,-1,-1,-1,-1,-1,-1}},--ThiÕu l©m thiÒn t«ng
	[4] = {"ViÖt Yªn Phi Tinh Thñ",{0,0,30004,1,1,-1,-1,-1,-1,-1,-1}},--ThiÕu l©m vâ t«ng
	[6] = {"ViÖt Yªn Phi Tinh Ch©m",{0,1,30005,1,1,-1,-1,-1,-1,-1,-1}},-- §­êng m«n
	[8] = {"ViÖt Yªn Phi Tinh KiÕm",{0,2,30006,1,1,-1,-1,-1,-1,-1,-1}},--Nga My PhËt gia
	[9] = {"ViÖt Yªn Phi Tinh CÇm",{0,10,30007,1,1,-1,-1,-1,-1,-1,-1}},--Nga My tôc gia
	[11] = {"ViÖt Yªn Phi Tinh Thñ",{0,0,30008,1,1,-1,-1,-1,-1,-1,-1}},-- C¸i Bang TÜnh Y
	[12] = {"ViÖt Yªn Tr¶m NguyÖt C«n",{0,5,30009,1,1,-1,-1,-1,-1,-1,-1}},--C¸i Bang ¤ Y
	[14] = {"ViÖt Yªn Tr¶m NguyÖt KiÕm",{0,2,30010,1,1,-1,-1,-1,-1,-1,-1}},-- Vâ §ang §¹o Gia
	[15] = {"ViÖt Yªn Tr¶m NguyÖt Bót",{0,9,30011,1,1,-1,-1,-1,-1,-1,-1}},-- Vâ ®ang tôc gia
	[17] = {"ViÖt Yªn Tr¶m NguyÖt Th­¬ng",{0,6,30012,1,1,-1,-1,-1,-1,-1,-1}},--D­¬ng Gia Th­¬ng
	[18] = {"ViÖt Yªn Tr¶m NguyÖt Cung",{0,4,30013,1,1,-1,-1,-1,-1,-1,-1}},-- D­¬ng m«n cung
	[20] = {"ViÖt Yªn Tr¶m NguyÖt NhÉn",{0,7,30014,1,1,-1,-1,-1,-1,-1,-1}},-- HiÖp §éc
	[21] = {"ViÖt Yªn Tr¶m NguyÖt Tr¶o",{0,11,30015,1,1,-1,-1,-1,-1,-1,-1}},-- Ta §éc
}


-- Vò KhÝ §¹i ViÖt Yªn 
tb_golden_dvy_weapon = 
{
	[2] = {"§¹i ViÖt Yªn Phi Tinh §ao",{0,3,30016,1,1,-1,-1,-1,-1,-1,-1,0,12}},--ThiÕu l©m tôc gia 
	[3] = {"§¹i ViÖt Yªn Phi Tinh Tr­îng",{0,8,30018,1,1,-1,-1,-1,-1,-1,-1,0,12}},-- ThiÕu l©m thiÒn t«ng
	[4] = {"§¹i ViÖt Yªn Phi Tinh Thñ",{0,0,30019,1,1,-1,-1,-1,-1,-1,-1,0,12}},-- ThiÕu l©m vâ t«ng
	[6] = {"§¹i ViÖt Yªn Phi Tinh Ch©m",{0,1,30020,1,1,-1,-1,-1,-1,-1,-1,0,12}},-- §­êng m«n
	[8] = {"§¹i ViÖt Yªn Phi Tinh KiÕm",{0,2,30021,1,1,-1,-1,-1,-1,-1,-1,0,12}},--Nga My PhËt Gia
	[9] = {"§¹i ViÖt Yªn Phi Tinh CÇm",{0,10,30022,1,1,-1,-1,-1,-1,-1,-1,0,12}},--Nga My tôc gia
	[11] = {"§¹i ViÖt Yªn Phi Tinh Thñ",{0,0,30023,1,1,-1,-1,-1,-1,-1,-1,0,12}},--- C¸i bang  tÜnh y
	[12] = {"§¹i ViÖt Yªn Tr¶m NguyÖt C«n",{0,5,30024,1,1,-1,-1,-1,-1,-1,-1,0,12}},-- C¸i Bang è y
	[14] = {"§¹i ViÖt Yªn Tr¶m NguyÖt KiÕm ",{0,2,30025,1,1,-1,-1,-1,-1,-1,-1,0,12}},-- Vâ ®ang ®¹o gia
	[15] = {"§¹i ViÖt Yªn Tr¶m NguyÖt Bót",{0,9,30026,1,1,-1,-1,-1,-1,-1,-1,0,12}},-- Vâ ®ang tôc gia
	[17] = {"§¹i ViÖt Yªn Tr¶m NguyÖt Th­¬ng",{0,6,30027,1,1,-1,-1,-1,-1,-1,-1,0,12}},-- D­êng m«n th­¬ng
	[18] = {"§¹i ViÖt Yªn Tr¶m NguyÖt Cung",{0,4,30028,1,1,-1,-1,-1,-1,-1,-1,0,12}},-- §­êng m«n cung
	[20] = {"§¹i ViÖt Yªn Tr¶m NguyÖt NhÉn",{0,7,30029,1,1,-1,-1,-1,-1,-1,-1,0,12}},-- HiÖp ®éc
	[21] = {"§¹i ViÖt Yªn Tr¶m NguyÖt Tr¶o",{0,11,30030,1,1,-1,-1,-1,-1,-1,-1,0,12}},--Tµ §éc
}

--- Vò khÝ s­ m«n 4
tb_golden_Faction4_weapon = 
{
	[2] = {"B¸t Bé Thiªn Long Thiªn Chóng §ao",3,230},
	[3] = {"V« L­îng Ph¸p T«n ThiÒn Tr­îng",8,330},
	[4] = {"B¸t B¶o La H¸n §¹i Thõa Thñ",0,430}, 
	[6] = {"Thiªn C¬ Sø Gi¶ ThÇn TriÖu Ch©m",1,630}, 
	[8] = {"B¹ch Liªn Tiªn Tö B¶o UÈn KiÕm",2,828},
	[9] = {"Ngäc VËn Tiªn Tö HuyÒn Hån CÇm",10,928},
	[11] = {"Long §Çu ThÇn C¸i §»ng V©n Thñ",0,1130},
	[12] = {"KhÊt Thiªn ThÇn C¸i V©n Du C«n",5,1230},
	[14] = {"Ch­ëng Kinh Thanh Quang KiÕm",2,1430},
	[15] = {"Th¸i Êt T¶n Nh©n H¹o Nhiªn Bót",9,1530},
	[17] = {"Long T­¬ng T­íng Qu©n Th­¬ng",6,1730,},
	[18] = {"Hæ Dùc T­íng Qu©n Cung",4,1830},
	[20] = {"U Minh Quû S¸t Tu La NhÉn",7,2030},
	[21] = {"V« §éng La S¸t TrÈm HuyÕt Tr¶o",11,2130},
}

-- L­u  max sè lÇn ®µo r­¬ng trong ngµy
tbOpenBoxTimes = {1,8,12,16}

-- Table nµy l­u c¸c vËt phÈm b¹n cÇn ®æi  b»ng ®iÓm tÝch lòy
tbChangeAccumulateVLTB = 
{
	[1] = {130,"§Þnh Hån Thiªn Th¹ch",{2,1,1067,1,4},7*24*3600 },
	[2] = { 130,"L¨ng Ba Vi Bé",{0,112,78,1,4}},
	[3] = {90,"N÷ Oa Tinh Th¹ch",{2,1,504,8,4},7*24*3600},
	[4] = {50,"Nãn S­ m«n bé 4"},
	[5] = {50,"Aã S­ m«n bé 4"},
	[6] = { 50,"QuÇn S­ m«n bé 4"},
	[7] = {50,"Trang søc 1 S­ m«n bé 4"},
	[8] = {50,"Trang søc 1 S­ m«n bé 4"},
	[9] = {40,"Thiªn Qu¸i Th¹ch",{2,0,1084,3}},
	[10] = {40,"Thiªn Th¹ch Linh Th¹ch",{2,1,1068,1,4},7*24*3600 },
	[11] = {30,"Phi Yªn Th¹ch",{2,1,30130,5,4}},
}
tbChangeAccumulateVLTBBKL = 
{
	[1] = {1350,"Ch×a Khãa Vµng",{2,1,30133,50,1}},
	[2] = {400,"Thá ®en",{0,105,30039,1,1,-1,-1,-1,-1,-1,-1,-1,0}},
	[3] = {600,"B¸o §en B¶o B¶o",{0,105,30029,1,1,-1,-1,-1,-1,-1,-1,-1,0}},
	[4] = {600,"Tiªn Du KiÕm",{0,105,10110,1,1,-1,-1,-1,-1,-1,-1,-1,0}},
	[5] = {660,"Thiªn Th¹ch Linh Th¹ch",{2,1,1068,1,1},15*24*3600 },
	[6] = {880,"§Þnh Hån Thiªn Th¹ch",{2,1,1067,1,1},15*24*3600 },
	[7] = {1100,"§¹i §Þnh Hån",{2,1,1113,1,1},15*24*3600 },
	[8] = {390,"N÷ Oa Tinh Th¹ch",{2,1,504,12,4},15*24*3600},
	[9] = {150,"§Þnh Hån Thiªn Th¹ch",{2,1,1067,1,1},7*24*3600 },
--	[10] ={450,"Th­¬ng ¦ng Tiªn Phong - Phï"},
	[11] = {300,"ChuyÓn Sinh §¬n",{2,1,30345,1,1},60*24*3600 },
	[12] = {50,"L¨ng Ba Vi Bé",{0,112,78,1,1}},
	[13] = {1650,"Ma Tinh",{2,1,30497,500,4}},	
	[14] = {200,"Cæ Linh Th¹ch",{2,1,30368,200,1}},		
	[15] = {300,"Cæ Linh Ngäc",{2,1,30369,200,1}},		
	[16] = {110,"C­êng Hãa QuyÓn CÊp 12",{2,1,30424,10,1}},	
	[17] = {250,"C­êng Hãa QuyÓn CÊp 13",{2,1,30425,10,1}},	
	[18] = {550,"C­êng Hãa QuyÓn CÊp 14",{2,1,30426,10,1}},	
	[19] = {1200,"C­êng Hãa QuyÓn CÊp 15",{2,1,30427,10,1}},		
--	[20] = {"Danh hiÖu TuyÖt ThÕ Cao Nh©n"},	
}
tbHaoNguyet_Ao_BKL = {
			[2] = 	{{"H¹o NguyÖt-§é N¹n T«n Gi¶ Bµo",0,100,3064},	{"H¹o NguyÖt-§é N¹n T«n Gi¶ Bµo",0,100,3065}},
			[3] = 	{{"H¹o NguyÖt-§é ¸ch T«n Gi¶ Bµo",0,100,3068},	{"H¹o NguyÖt-§é ¸ch T«n Gi¶ Bµo",0,100,3069}},
			[4] = 	{{"H¹o NguyÖt-§é KiÕp T«n Gi¶ Bµo",0,100,3066},	{"H¹o NguyÖt-§é KiÕp T«n Gi¶ Bµo",0,100,3067}},
			[6] = 	{{"H¹o NguyÖt-V¹n KiÕp Th¸nh Thñ Y",0,100,3070},	{"H¹o NguyÖt-V¹n KiÕp Th¸nh Thñ Y",0,100,3071},{"H¹o NguyÖt-V¹n KiÕp Th¸nh Thñ Y",0,100,3072},{"H¹o NguyÖt-V¹n KiÕp Th¸nh Thñ Y",0,100,3073}},
			[8] = 	{nil,								nil,							{"H¹o NguyÖt-PhËt V©n Th¸nh C« Y",0,100,3074},{"H¹o NguyÖt-PhËt V©n Th¸nh C« Y",0,100,3075}},
			[9] = 	{nil,								nil,							{"H¹o NguyÖt-PhËt TrÇn Th¸nh C« Y",0,100,3076},{"H¹o NguyÖt-PhËt TrÇn Th¸nh C« Y",0,100,3077}},
			[11] = 	{{"H¹o NguyÖt-Trôc Phông Thiªn C¸i Y",0,100,3078},	{"H¹o NguyÖt-Trôc Phông Thiªn C¸i Y",0,100,3079},{"H¹o NguyÖt-Trôc Phông Thiªn C¸i Y",0,100,3080},{"H¹o NguyÖt-Trôc Phông Thiªn C¸i Y",0,100,3081}},
			[12] = 	{{"H¹o NguyÖt-Du Long §Þa KhÊt Y",0,100,3082},	{"H¹o NguyÖt-Du Long §Þa KhÊt Y",0,100,3083},{"H¹o NguyÖt-Du Long §Þa KhÊt Y",0,100,3084},{"H¹o NguyÖt-Du Long §Þa KhÊt Y",0,100,3085}},
			[14] = 	{{"H¹o NguyÖt-V« Cùc Thiªn T«n Bµo",0,100,3086},	{"H¹o NguyÖt-V« Cùc Thiªn T«n Bµo",0,100,3087},{"H¹o NguyÖt-V« Cùc Thiªn T«n Bµo",0,100,3088},{"H¹o NguyÖt-V« Cùc Thiªn T«n Bµo",0,100,3089}},
			[15] = 	{{"H¹o NguyÖt-BÝch L¹c Thiªn T«n Bµo",0,100,3090},	{"H¹o NguyÖt-BÝch L¹c Thiªn T«n Bµo",0,100,3091},{"H¹o NguyÖt-BÝch L¹c Thiªn T«n Bµo",0,100,3092},{"H¹o NguyÖt-BÝch L¹c Thiªn T«n Bµo",0,100,3093}},
			[17] = 	{{"H¹o NguyÖt-C¶m Thiªn §Êu Hån Gi¸p",0,100,3094},	{"H¹o NguyÖt-C¶m Thiªn §Êu Hån Gi¸p",0,100,3095},{"H¹o NguyÖt-C¶m Thiªn §Êu Hån Gi¸p",0,100,3096},{"H¹o NguyÖt-C¶m Thiªn §Êu Hån Gi¸p",0,100,3097}},
			[18] = 	{{"H¹o NguyÖt-§Þnh Thiªn ThÇn NghÖ Gi¸p",0,100,3098},	{"H¹o NguyÖt-§Þnh Thiªn ThÇn NghÖ Gi¸p",0,100,3099},{"H¹o NguyÖt-§Þnh Thiªn ThÇn NghÖ Gi¸p",0,100,3100},{"H¹o NguyÖt-§Þnh Thiªn ThÇn NghÖ Gi¸p",0,100,3101}},
			[20] = 	{{"H¹o NguyÖt-Quû Xóc Tµ ThÇn Y",0,100,3102},	{"H¹o NguyÖt-Quû Xóc Tµ ThÇn Y",0,100,3103},{"H¹o NguyÖt-Quû Xóc Tµ ThÇn Y",0,100,3104},{"H¹o NguyÖt-Quû Xóc Tµ ThÇn Y",0,100,3105}},
			[21] = 	{{"H¹o NguyÖt-Vu Cèt §éc V­¬ng Y",0,100,3106},	{"H¹o NguyÖt-Vu Cèt §éc V­¬ng Y",0,100,3107},{"H¹o NguyÖt-Vu Cèt §éc V­¬ng Y",0,100,3108},{"H¹o NguyÖt-Vu Cèt §éc V­¬ng Y",0,100,3109}},
			[23] =  {{"H¹o NguyÖt-BÊt §éng Ch©n Tiªn Bµo",0,100,3110}, {"H¹o NguyÖt-BÊt §éng Ch©n Tiªn Bµo",0,100,3111},nil,nil},
			[29] =  {nil,nil,{"H¹o NguyÖt-Tª V©n Tiªn Tö Y",0,100,3124},{"H¹o NguyÖt-Tª V©n Tiªn Tö Y",	0,100,3125}},
			[30] =  {nil,nil,{"H¹o NguyÖt-Phi H¹ Tiªn Tö Y",0,100,3126},{"H¹o NguyÖt-Phi H¹ Tiªn Tö Y",	0,100,3127}},			
		}
tbHaoNguyet_Non_BKL = {
			[2] = 	{{"H¹o NguyÖt-§é N¹n T«n Gi¶ M·o",0,103,3064},	{"H¹o NguyÖt-§é N¹n T«n Gi¶ M·o",0,103,3065}},
			[3] = 	{{"H¹o NguyÖt-§é ¸ch T«n Gi¶ M·o",0,103,3068},	{"H¹o NguyÖt-§é ¸ch T«n Gi¶ M·o",0,103,3069}},
			[4] = 	{{"H¹o NguyÖt-§é KiÕp T«n Gi¶ M·o",0,103,3066},	{"H¹o NguyÖt-§é KiÕp T«n Gi¶ M·o",0,103,3067}},
			[6] = 	{{"H¹o NguyÖt-V¹n KiÕp Th¸nh Thñ Qu¸n",0,103,3070},	{"H¹o NguyÖt-V¹n KiÕp Th¸nh Thñ Qu¸n",0,103,3071},{"H¹o NguyÖt-V¹n KiÕp Th¸nh Thñ Qu¸n",0,103,3072},{"H¹o NguyÖt-V¹n KiÕp Th¸nh Thñ Qu¸n",0,103,3073}},
			[8] = 	{nil,								nil,							{"H¹o NguyÖt-PhËt V©n Th¸nh C« Tr©m",0,103,3074},{"H¹o NguyÖt-PhËt V©n Th¸nh C« Tr©m",0,103,3075}},
			[9] = 	{nil,								nil,							{"H¹o NguyÖt-PhËt TrÇn Th¸nh C« Tr©m",0,103,3076},{"H¹o NguyÖt-PhËt TrÇn Th¸nh C« Tr©m",0,103,3077}},
			[11] = 	{{"H¹o NguyÖt-Trôc Phông Thiªn C¸i C©n",0,103,3078},	{"H¹o NguyÖt-Trôc Phông Thiªn C¸i C©n",0,103,3079},{"H¹o NguyÖt-Trôc Phông Thiªn C¸i C©n",0,103,3080},{"H¹o NguyÖt-Trôc Phông Thiªn C¸i C©n",0,103,3081}},
			[12] = 	{{"H¹o NguyÖt-Du Long §Þa KhÊt C©n",0,103,3082},	{"H¹o NguyÖt-Du Long §Þa KhÊt C©n",0,103,3083},{"H¹o NguyÖt-Du Long §Þa KhÊt C©n",0,103,3084},{"H¹o NguyÖt-Du Long §Þa KhÊt C©n",0,103,3085}},
			[14] = 	{{"H¹o NguyÖt-V« Cùc Thiªn T«n Qu¸n",0,103,3086},	{"H¹o NguyÖt-V« Cùc Thiªn T«n Qu¸n",0,103,3087},{"H¹o NguyÖt-V« Cùc Thiªn T«n Qu¸n",0,103,3088},{"H¹o NguyÖt-V« Cùc Thiªn T«n Qu¸n",0,103,3089}},
			[15] = 	{{"H¹o NguyÖt-BÝch L¹c Thiªn T«n Qu¸n",0,103,3090},	{"H¹o NguyÖt-BÝch L¹c Thiªn T«n Qu¸n",0,103,3091},{"H¹o NguyÖt-BÝch L¹c Thiªn T«n Qu¸n",0,103,3092},{"H¹o NguyÖt-BÝch L¹c Thiªn T«n Qu¸n",0,103,3093}},
			[17] = 	{{"H¹o NguyÖt-C¶m Thiªn §Êu Hån Kh«i",0,103,3094},	{"H¹o NguyÖt-C¶m Thiªn §Êu Hån Kh«i",0,103,3095},{"H¹o NguyÖt-C¶m Thiªn §Êu Hån Kh«i",0,103,3096},{"H¹o NguyÖt-C¶m Thiªn §Êu Hån Kh«i",0,103,3097}},
			[18] = 	{{"H¹o NguyÖt-§Þnh Thiªn ThÇn NghÖ Kh«i",0,103,3098},	{"H¹o NguyÖt-§Þnh Thiªn ThÇn NghÖ Kh«i",0,103,3099},{"H¹o NguyÖt-§Þnh Thiªn ThÇn NghÖ Kh«i",0,103,3100},{"H¹o NguyÖt-§Þnh Thiªn ThÇn NghÖ Kh«i",0,103,3101}},
			[20] = 	{{"H¹o NguyÖt-Quû Xóc Tµ ThÇn C©n",0,103,3102},	{"H¹o NguyÖt-Quû Xóc Tµ ThÇn C©n",0,103,3103},{"H¹o NguyÖt-Quû Xóc Tµ ThÇn C©n",0,103,3104},{"H¹o NguyÖt-Quû Xóc Tµ ThÇn C©n",0,103,3105}},
			[21] = 	{{"H¹o NguyÖt-Vu Cèt §éc V­¬ng C©n",0,103,3106},	{"H¹o NguyÖt-Vu Cèt §éc V­¬ng C©n",0,103,3107},{"H¹o NguyÖt-Vu Cèt §éc V­¬ng C©n",0,103,3108},{"H¹o NguyÖt-Vu Cèt §éc V­¬ng C©n",0,103,3109}},
			[23] =  {{"H¹o NguyÖt-BÊt §éng Ch©n Tiªn Qu¸n",0,103,3110}, {"H¹o NguyÖt-BÊt §éng Ch©n Tiªn Qu¸n",0,103,3111},nil,nil},
			[29] =  {nil,nil,{"H¹o NguyÖt-Tª V©n Tiªn Tö Tr©m",0,103,3124},{"H¹o NguyÖt-Tª V©n Tiªn Tö Tr©m",	0,103,3125}},
			[30] =  {nil,nil,{"H¹o NguyÖt-Phi H¹ Tiªn Tö Tr©m",0,103,3126},{"H¹o NguyÖt-Phi H¹ Tiªn Tö Tr©m",	0,103,3127}},			
		}	
tbHaoNguyet_Quan_BKL = {
			[2] = 	{{"H¹o NguyÖt-§é N¹n T«n Gi¶ Trang",0,101,3064},	{"H¹o NguyÖt-§é N¹n T«n Gi¶ Trang",0,101,3065}},
			[3] = 	{{"H¹o NguyÖt-§é ¸ch T«n Gi¶ Trang",0,101,3068},	{"H¹o NguyÖt-§é ¸ch T«n Gi¶ Trang",0,101,3069}},
			[4] = 	{{"H¹o NguyÖt-§é KiÕp T«n Gi¶ Trang",0,101,3066},	{"H¹o NguyÖt-§é KiÕp T«n Gi¶ Trang",0,101,3067}},
			[6] = 	{{"H¹o NguyÖt-V¹n KiÕp Th¸nh Thñ Trang",0,101,3070},	{"H¹o NguyÖt-V¹n KiÕp Th¸nh Thñ Trang",0,101,3071},{"H¹o NguyÖt-V¹n KiÕp Th¸nh Thñ Trang",0,101,3072},{"H¹o NguyÖt-V¹n KiÕp Th¸nh Thñ Trang",0,101,3073}},
			[8] = 	{nil,								nil,							{"H¹o NguyÖt-PhËt V©n Th¸nh C« QuÇn",0,101,3074},{"H¹o NguyÖt-PhËt V©n Th¸nh C« QuÇn",0,101,3075}},
			[9] = 	{nil,								nil,							{"H¹o NguyÖt-PhËt TrÇn Th¸nh C« QuÇn",0,101,3076},{"H¹o NguyÖt-PhËt TrÇn Th¸nh C« QuÇn",0,101,3077}},
			[11] = 	{{"H¹o NguyÖt-Trôc Phông Thiªn C¸i Trang",0,101,3078},	{"H¹o NguyÖt-Trôc Phông Thiªn C¸i Trang",0,101,3079},{"H¹o NguyÖt-Trôc Phông Thiªn C¸i Trang",0,101,3080},{"H¹o NguyÖt-Trôc Phông Thiªn C¸i Trang",0,101,3081}},
			[12] = 	{{"H¹o NguyÖt-Du Long §Þa KhÊt Trang",0,101,3082},	{"H¹o NguyÖt-Du Long §Þa KhÊt Trang",0,101,3083},{"H¹o NguyÖt-Du Long §Þa KhÊt Trang",0,101,3084},{"H¹o NguyÖt-Du Long §Þa KhÊt Trang",0,101,3085}},
			[14] = 	{{"H¹o NguyÖt-V« Cùc Thiªn T«n Trang",0,101,3086},	{"H¹o NguyÖt-V« Cùc Thiªn T«n Trang",0,101,3087},{"H¹o NguyÖt-V« Cùc Thiªn T«n Trang",0,101,3088},{"H¹o NguyÖt-V« Cùc Thiªn T«n Trang",0,101,3089}},
			[15] = 	{{"H¹o NguyÖt-BÝch L¹c Thiªn T«n Trang",0,101,3090},	{"H¹o NguyÖt-BÝch L¹c Thiªn T«n Trang",0,101,3091},{"H¹o NguyÖt-BÝch L¹c Thiªn T«n Trang",0,101,3092},{"H¹o NguyÖt-BÝch L¹c Thiªn T«n Trang",0,101,3093}},
			[17] = 	{{"H¹o NguyÖt-C¶m Thiªn §Êu Hån Trang",0,101,3094},	{"H¹o NguyÖt-C¶m Thiªn §Êu Hån Trang",0,101,3095},{"H¹o NguyÖt-C¶m Thiªn §Êu Hån Trang",0,101,3096},{"H¹o NguyÖt-C¶m Thiªn §Êu Hån Trang",0,101,3097}},
			[18] = 	{{"H¹o NguyÖt-§Þnh Thiªn ThÇn NghÖ Trang",0,101,3098},	{"H¹o NguyÖt-§Þnh Thiªn ThÇn NghÖ Trang",0,101,3099},{"H¹o NguyÖt-§Þnh Thiªn ThÇn NghÖ Trang",0,101,3100},{"H¹o NguyÖt-§Þnh Thiªn ThÇn NghÖ Trang",0,101,3101}},
			[20] = 	{{"H¹o NguyÖt-Quû Xóc Tµ ThÇn Trang",0,101,3102},	{"H¹o NguyÖt-Quû Xóc Tµ ThÇn Trang",0,101,3103},{"H¹o NguyÖt-Quû Xóc Tµ ThÇn Trang",0,101,3104},{"H¹o NguyÖt-Quû Xóc Tµ ThÇn Trang",0,101,3105}},
			[21] = 	{{"H¹o NguyÖt-Vu Cèt §éc V­¬ng Trang",0,101,3106},	{"H¹o NguyÖt-Vu Cèt §éc V­¬ng Trang",0,101,3107},{"H¹o NguyÖt-Vu Cèt §éc V­¬ng Trang",0,101,3108},{"H¹o NguyÖt-Vu Cèt §éc V­¬ng Trang",0,101,3109}},
			[23] =  {{"H¹o NguyÖt-BÊt §éng Ch©n Tiªn Trang",0,101,3110}, {"H¹o NguyÖt-BÊt §éng Ch©n Tiªn Trang",0,101,3111},nil,nil},
			[29] =  {nil,nil,{"H¹o NguyÖt-Tª V©n Tiªn Tö QuÇn",0,101,3124},{"H¹o NguyÖt-Tª V©n Tiªn Tö QuÇn",	0,101,3125}},
			[30] =  {nil,nil,{"H¹o NguyÖt-Phi H¹ Tiªn Tö ",0,101,3126},{"H¹o NguyÖt-Phi H¹ Tiªn Tö ",	0,101,3127}},			
		}	
tbHaoNguyet_VuKhi_BKL = {
		[2]={"H¹o NguyÖt-§é N¹n T«n Gi¶ PhËt §ao",{0,3,8972,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[3]={"H¹o NguyÖt-§é ¸ch T«n Gi¶ PhËt Tr­îng",{0,8,8974,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[4]={"H¹o NguyÖt-§é KiÕp T«n Gi¶ PhËt Thñ",{0,0,8973,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[6]={"H¹o NguyÖt-V¹n KiÕp Th¸nh Thñ Tr©m",{0,1,8975,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[8]={"H¹o NguyÖt-PhËt V©n Th¸nh C« Liªn KiÕm",{0,2,8976,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[9]={"H¹o NguyÖt-PhËt TrÇn Th¸nh C« CÇm",{0,10,8977,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[11]={"H¹o NguyÖt-Trôc Phông Thiªn C¸i Thñ",{0,0,8978,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[12]={"H¹o NguyÖt-Du Long §Þa KhÊt C«n",{0,5,8979,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[14]={"H¹o NguyÖt-V« Cùc Thiªn T«n Tóc KiÕm",{0,2,8980,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[15]={"H¹o NguyÖt-BÝch L¹c Thiªn T«n Bót",{0,9,8981,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[17]={"H¹o NguyÖt-C¶m Thiªn §Êu Hån Th­¬ng",{0,6,8982,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[18]={"H¹o NguyÖt-§Þnh Thiªn ThÇn NghÖ Cung",{0,4,8983,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[20]={"H¹o NguyÖt-Quû Xóc Tµ ThÇn §ao",{0,7,8984,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[21]={"H¹o NguyÖt-Vu Cèt §éc V­¬ng Tr¶o",{0,11,8985,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[23]={"H¹o NguyÖt-BÊt §éng Ch©n Tiªn KiÕm",{0,2,8986,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[29]={"H¹o NguyÖt-Tª V©n Tiªn Tö PhiÕn",	{0,13,8990,1,1,-1,-1,-1,-1,-1,-1,0,10}},
		[30]={"H¹o NguyÖt-Phi H¹ Tiªn Tö ¦u Lan Tiªu",{0,12,8991,1,1,-1,-1,-1,-1,-1,-1,0,10}},		
	}
tbHaoNguyet_NgocBoi_BKL = {
		{"H¹o NguyÖt-¤ L©n B¶o Giíi (trang søc søc m¹nh)",{0,102,3175,1,4,-1,-1,-1,-1,-1,-1}},
		{"H¹o NguyÖt-Tö Giao Ngäc Béi (trang søc th©n ph¸p)",{0,102,3177,1,4,-1,-1,-1,-1,-1,-1}},
		{"H¹o NguyÖt-V©n Hæ LÖnh Bµi (trang søc néi c«ng)",{0,102,3179,1,4,-1,-1,-1,-1,-1,-1}},
		{"H¹o NguyÖt-XÝch T­íc ChØ Hoµn (trang søc linh ho¹t)",{0,102,3181,1,4,-1,-1,-1,-1,-1,-1}},
		{"H¹o NguyÖt-BÝch Quy H¹ng Liªn (trang søc g©n cèt)",{0,102,3183,1,4,-1,-1,-1,-1,-1,-1}},
	}
function CheckAwardLevel_BKL()
	return gf_GetTaskByte(TSK_BKLB_FLAG, BYTE_BKLB_LEVELAWARD)
end

function CheckLevel_BKL()
	local nAwardLevel = 0;
	local nLevel = GetLevel();
	local nRep = GetReputation();
	local nFaction = GetTask(336);
	local nHor = abs(GetTask(701));
	
	for i = 99, 74, -1 do
		if nLevel >= i and nRep >= tb_golden_award_BKL[i][1] and nFaction >= tb_golden_award_BKL[i][2] and nHor >= tb_golden_award_BKL[i][3] and CheckAwardLevel_BKL() >=  tb_golden_award_BKL[i][4] then
			nAwardLevel = i;
			break;
		end
	end
	return nAwardLevel;
end

function CheckDigLevel()
	local nType = 0	
	local nLevel = GetLevel();
	local nRep = GetReputation();
	local nFaction = GetTask(336);
	local nHor = abs(GetTask(701));
	
	if nLevel >= 73 and nLevel <= 79 then
		nType =  1
	elseif nLevel >= 80 and nLevel <= 84 then
		nType = 2
	elseif nLevel >= 85 and nLevel <=89 then
		nType = 3
	elseif nLevel >= 90 then
		nType = 4
	else
		return nType
	end
	if nRep >= tb_golden_digging[nType][1] and nFaction >= tb_golden_digging[nType][2] and nHor >= tb_golden_digging[nType][3] and CheckActivated_BKL() == 2 then
		return nType	
	end	
	return 0
end

-------------
function CheckAccountExt_BKL()
	return gf_GetExtPointByte(EXT_POINT_BKLB, BYTE_BKLB_TYPE)
end 

function CheckActivatedExt_BKL()
	if gf_GetExtPointByte(EXT_POINT_BKLB, BYTE_BKLB_TYPE) == 3 then	--and gf_GetTaskByte(TSK_BKLB_FLAG, BYTE_BKLB_STATUS) == 3
		-- ThiÕu Niªn Anh Hïng
		return 1
	elseif gf_GetExtPointByte(EXT_POINT_BKLB, BYTE_BKLB_TYPE) == 4 then	--and gf_GetTaskByte(TSK_BKLB_FLAG, BYTE_BKLB_STATUS) == 4
		-- Vâ L©m TiÒn Bèi
		return 2
	else
		-- Ch­a kÝch ho¹t
		return 0
	end
end
-------------
function CheckActivated_BKL()
	if GetTask(TSK_BKLB_ACTIVE)  == 3 and gf_GetTaskByte(TSK_BKLB_FLAG, BYTE_BKLB_STATUS) == 3 then  
		-- ThiÕu Niªn Anh Hïng
		return 1
	elseif GetTask(TSK_BKLB_ACTIVE)  == 4 and gf_GetTaskByte(TSK_BKLB_FLAG, BYTE_BKLB_STATUS) == 4 then 
		-- Vâ L©m TiÒn Bèi
		return 2
	else
		-- Ch­a kÝch ho¹t
		return 0
	end
end

function GoldenGiveJewel_BKL()
	local nPos = 0
	local nRand = random(1, 1000)
	local nBody = GetBody();
	local nRoute = GetPlayerRoute();
	for i = 1, getn(tb_golden_jew_BKL) do
		if nRand > 750 then
			if nRoute == 8 or nRoute == 9 then
				nBody = nBody - 2
			end
			local nP = nRoute * 100 + 30 + nBody + 4
			gf_AddItemEx2({0,102,nP,1,1,-1,-1,-1,-1,-1,-1}, "Trang suc 2", szBKLBLogHeader, "nhËn ®­îc")
			return
		elseif nRand > 500 then
			if nRoute == 8 or nRoute == 9 then
				nBody = nBody - 2
			end
			local nP = nRoute * 100 + 30 + nBody
			gf_AddItemEx2({0,102,nP,1,1,-1,-1,-1,-1,-1,-1}, "Trang suc 1", szBKLBLogHeader, "nhËn ®­îc")
			return
		elseif nRand > nPos and nRand <= nPos + tb_golden_jew_BKL[i][3] then
			ConfirmGetJewel_BKL(tb_golden_jew_BKL, i)
		end
		nPos = nPos + tb_golden_jew_BKL[i][3]
	end
end

function ConfirmGetJewel_BKL(tTable, nNum)
	local nType = tb_golden_jew_BKL[nNum][1]
	local nRoute = GetPlayerRoute()
	local nBody = GetBody()
	if nType == 1 then
	--	Msg2Player("So 2a")
		gf_AddItemEx2(tb_golden_jew_BKL[nNum][4], tb_golden_jew_BKL[nNum][2], szBKLBLogHeader, "nhËn ®­îc")
	elseif nType == 2 then
	--	Msg2Player("So 2b")
		gf_AddItemEx2(tb_golden_jew_BKL[nNum][2][nRoute][2], tb_golden_jew_BKL[nNum][2][nRoute][1], szBKLBLogHeader, "nhËn ®­îc")
	elseif nType == 3 then
		local nP = tb_golden_jew_BKL[nNum][4][3]
		local tbody = {0, 2, 4, 6}
		for i = 1, 4 do
			if nBody == i then
				nP =  tb_golden_jew_BKL[nNum][4][3]+ nBody + tbody[i]
				break
			end
		end
		
		gf_AddItemEx2({tb_golden_jew_BKL[nNum][4][1], tb_golden_jew_BKL[nNum][4][2], nP,1,1,-1,-1,-1,-1,-1,-1}, "trang søc", szBKLBLogHeader, "nhËn ®­îc")
	end
end

function CheckCharged_BKL()
	return gf_GetExtPointByte(EXT_POINT_BKLB, BYTE_BKLB_COUNT)
end

function GetTQVD()
	local nRand = random(1,100)
	local nBody = GetBody()
	if nRand <= 55 then
		gf_AddItemEx2({0,103,8050 + nBody,1,1,-1,-1,-1,-1,-1,-1}, "Tö Quang Viªm §Õ Kh«i", szBKLBLogHeader, "nhËn ®­îc")
	elseif nRand <= 99 then
		gf_AddItemEx2({0,101,8050 + nBody,1,1,-1,-1,-1,-1,-1,-1}, "Tö Quang Viªm §Õ Trang", szBKLBLogHeader, "nhËn ®­îc")
	else
		gf_AddItemEx2({0,100,8050 + nBody,1,1,-1,-1,-1,-1,-1,-1}, "Tö Quang Viªm §Õ Gi¸p", szBKLBLogHeader, "nhËn ®­îc")
	end
end

-- Ph¶i ®æi l¹i thµnh TaskID
function get_friendly_award_BKL(nType_VLCH)
	if CheckActivatedExt_BKL() ~= 2 then 		--CheckActivated_BKL() ~= 2 and 
		Talk(1, "", "<color=green>Chñ Phßng M¸y<color>: Tµi kho¶n cña c¸c h¹ ch­a kÝch ho¹t nhËn th­ëng hoÆc kh«ng ph¶i TuyÖt ThÕ Cao Nh©n!")
		return
	end
	
	local nWeek = tonumber(date("%w"))
	if nWeek ~= 5 and nWeek ~= 6 and nWeek ~= 0 then
		Talk(1, "", "<color=green>Chñ Phßng M¸y<color>: ChØ cã thÓ nhËn phÇn th­ëng nµy vµo thø s¸u, thø b¶y vµ chñ nhËt.");
		return
	end
	
	local nCity = GetWorldPos()
--	Msg2Player("Gia trÞ City: "..nCity)
	local nCheckCity = 0
--	for i = 1, getn(tb_main_city_bkl) do
--		--print(tb_main_city)
--		Msg2Player("Gia trÞ table City: "..getn(tb_main_city_bkl))
--		if nCity == tb_main_city_bkl[i] then
--			Msg2Player("Vao a")
--			nCheckCity = 1
--			break
--		end
--	end
	if tb_main_city_bkl[nCity] ~= 1 then
		Talk(1, "", "<color=green>Chñ Phßng M¸y<color>: ChØ cã thÓ kÝch ho¹t nhËn th­ëng trong thÊt ®¹i thµnh thÞ.");
		return
	end
	
	local nTeamSize = GetTeamSize()
	local nOldPlayerIdx = PlayerIndex;	
	
	if GetName() ~= GetCaptainName() then
		Talk(1, "", "<color=green>Chñ Phßng M¸y<color>: ChØ cã ®éi tr­ëng míi cã thÓ kÝch ho¹t nhËn th­ëng!")
		return
	end
	if nTeamSize < 2 then
		Talk(1,"","Tæ ®éi ph¶i cã 2 ng­êi trë lªn míi kick ho¹t ®­îc !")
		return
	end
	if nType_VLCH == 2 then
		if GetItemCount(2,1,30230) < 10 or GetCash() < 200000 then
			Talk(1,"","C¸c h¹ kh«ng cã ®ñ 10 Xu vËt phÈm hoÆc 20 vµng ®Ó kÝch ho¹t nhËn th­ëng VIP !!!!")
			return
		end
	end
	local nActivatedDate = floor(GetTask(TSK_BKLB_VLCH) / 100)
	local nDate = tonumber(date("%y%m%d"))
	if nActivatedDate ~= nDate then
		SetTask(TSK_BKLB_VLCH, nDate * 100 )
	end
	
	local nActivatedTime = mod(GetTask(TSK_BKLB_VLCH), 100)
	if nActivatedTime > 0 then
		Talk(1, "", "<color=green>Chñ Phßng M¸y<color>: C¸c h¹ ®· kÝch ho¹t nhËn th­ëng h«m nay, ngµy mai h·y kÝch ho¹t tiÕp.");
		return
	end
	
	local szFailMember = ""
	local nDay = tonumber(date("%d"))
	local nMonth = tonumber(date("%m"))
	for i = 1, nTeamSize do
		PlayerIndex = GetTeamMember(i)
		local nCity2 = GetWorldPos()
		if gf_GetTaskByte(TASK_FRIENDLY_AWARD_BKL, BYTE_FRIENDLY_AWARD_DAY_BKL) ~= nDay or gf_GetTaskByte(TASK_FRIENDLY_AWARD_BKL, BYTE_FRIENDLY_AWARD_MONTH_BKL) ~= nMonth then
			gf_SetTaskByte(TASK_FRIENDLY_AWARD_BKL, BYTE_FRIENDLY_AWARD_DAY_BKL, nDay)
			gf_SetTaskByte(TASK_FRIENDLY_AWARD_BKL, BYTE_FRIENDLY_AWARD_MONTH_BKL, nMonth)
			gf_SetTaskByte(TASK_FRIENDLY_AWARD_BKL, BYTE_FRIENDLY_AWARD_COUNT_BKL, 0)
		end
		
		if CheckActivatedExt_BKL() ~= 2 then	--CheckActivated_BKL() ~= 2 and 
			Talk(1, "", "<color=green>Chñ Phßng M¸y<color>: Tµi kho¶n cña c¸c h¹ ch­a kÝch ho¹t nhËn th­ëng hoÆc kh«ng ph¶i TuyÖt ThÕ Cao Nh©n!")
			szFailMember = GetName()
			gf_Msg2Team(format("%s kh«ng cã kh«ng ph¶i TuyÖt ThÕ Cao Nh©ni, kh«ng thÓ nhËn th­ëng.", szFailMember))	
			return
		end
		
		if GetPlayerRoute() == 0 then
			szFailMember = GetName()
			gf_Msg2Team(format("%s ch­a gia nhËp hÖ ph¸i, kh«ng thÓ nhËn th­ëng.", szFailMember))
			return
		end				
		if GetLevel() < 80 then
			szFailMember = GetName()
			gf_Msg2Team(format("%s ch­a ®¹t cÊp 80, kh«ng thÓ nhËn th­ëng.", szFailMember))
			return
		end
		if gf_Check55HaveSkill() == 0 then
			szFailMember = GetName()
			gf_Msg2Team(format("%s ch­a häc ®ñ vâ c«ng, kh«ng thÓ nhËn th­ëng.", szFailMember))
			return
		end
		if gf_GetTaskByte(TASK_FRIENDLY_AWARD_BKL, BYTE_FRIENDLY_AWARD_COUNT_BKL) >= 1 then
			szFailMember = GetName()
			gf_Msg2Team(format("%s ®· nhËn th­ëng h«m nay råi, kh«ng thÓ nhËn th­ëng thªm n÷a.", szFailMember))
			return
		end
		if nCity2 ~= nCity then
			szFailMember = GetName()
			gf_Msg2Team(format("%s kh«ng cïng b¶n ®å víi ®éi tr­ëng, kh«ng thÓ nhËn th­ëng.", szFailMember))
			return
		end
	end
	PlayerIndex = nOldPlayerIdx
	-- xãa vËt phÈm khi kÝch ho¹t VIP
	if nType_VLCH == 2 then
		if DelItem(2,1,30230,10) == 1 and Pay(200000) == 1 then
			 gf_WriteLogEx(szBKLBLogHeader, "kick ho¹t thµnh c«ng", 1, "TTCN VIP")
		end
	else
		gf_WriteLogEx(szBKLBLogHeader, "kick ho¹t thµnh c«ng", 1, "TTCN")
	end
	----------	
	SetTask(TSK_BKLB_VLCH, GetTask(TSK_BKLB_VLCH) + 1)
	for i = 1, nTeamSize do
		PlayerIndex = GetTeamMember(i)
--		if GetName() ~= GetCaptainName() then
			gf_SetTaskByte(TASK_FRIENDLY_AWARD_BKL, BYTE_FRIENDLY_AWARD_COUNT_BKL, gf_GetTaskByte(TASK_FRIENDLY_AWARD_BKL, BYTE_FRIENDLY_AWARD_COUNT_BKL) + 1)
			local nExp = 2000000 + (3000000 * nTeamSize)
			if nType_VLCH == 2 then
				nExp = 2000000 + (5000000 * nTeamSize)
			end
			ModifyExp(nExp)
			Say("<color=green>Chñ Phßng M¸y<color>: Chóc mõng c¸c h¹ nhËn ®­îc phÇn th­ëng TuyÖt ThÕ Cao Nh©n!",0)		
			WriteLogEx(szBKLBLogHeader,"nhËn phÇn th­ëng TuyÖt ThÕ Cao Nh©n")
	--	end
	end
	PlayerIndex = nOldPlayerIdx
	--gf_SetTaskByte(TASK_FRIENDLY_AWARD, BYTE_FRIENDLY_AWARD_COUNT, gf_GetTaskByte(TASK_FRIENDLY_AWARD, BYTE_FRIENDLY_AWARD_COUNT) + 1)
	--ModifyExp(3000000)
	--Say("<color=green>Chñ Phßng M¸y<color>: Chóc mõng c¸c h¹ kÝch ho¹t ®­îc phÇn th­ëng Vâ L©m ChiÕn H÷u!",0)		
	--WriteLogEx(szLogTitle,"kÝch ho¹t nhËn phÇn th­ëng Vâ L©m ChiÕn H÷u")
end

--- Hµm tÆng pet cÊp 1
function GivePet1Award()
	local nCurLevel = mod(GetTask(TASK_VNG_PET), 100)
	-- KiÓm tra xem ®· luyÖn b¹n ®«ng hµnh hay ch­a
	if nCurLevel >= 1 then
		Talk(1, "", "C¸c h¹ ®· luyÖn B¾c §Èu Ngù Linh ThÇn ThuËt råi, kh«ng cÇn ph¶i kÝch ho¹t l¹i n÷a!")
		return
	end
	-- Tháa ®iÒu kiÖn kÝch ho¹t pet
	SetTask(TASK_VNG_PET, GetTask(TASK_VNG_PET) + 1)
	gf_SetTaskByte(TASK_VNG_PET_INFO, BYTE_PET_INFO_SEX,  random(1,2))
	gf_SetTaskByte(TASK_VNG_PET_INFO, BYTE_PET_INFO_TYPE,  1)
	Msg2Player("B¹n ®· kÝch ho¹t thµnh c«ng B¾c §Èu Ngù Linh ThÇn ThuËt!")
end

function Confirm_make_shimen_tier4BKLB(nUpgradeType)
	
	if gf_CheckPlayerRoute() == 0 then
		Talk(1, "", g_szNpcName.."Ph¶i gia nhËp hÖ ph¸i ta míi gióp ng­¬i ®­îc!");
		return 0;
	end
	
	-- ChØ sè base cña c¸c trang bÞ theo m«n ph¸i
	local tbShimen4Equip =
	{
		[2] =  {"ThiÕu L©m tôc gia", 230}, 
		[3] =  {"ThiÕu L©m thiÒn t¨ng", 330}, 
		[4] =  {"ThiÕu L©m vâ t«ng", 430}, 
		[14] =  {"Vâ §ang ®¹o gia", 1430}, 
		[15] =  {"Vâ §ang tôc gia", 1530}, 
		[8] =  {"Nga My phËt gia", 830}, 
		[9] =  {"Nga My tôc gia", 930}, 
		[11] =  {"C¸i Bang tÜnh y", 1130}, 
		[12] =  {"C¸i Bang « y", 1230}, 
		[6] =  {"§­êng M«n", 630}, 
		[17] =  {"D­¬ng Gia th­¬ng", 1730}, 
		[18] =  {"D­¬ng Gia cung", 1830}, 
		[20] = {"Ngò §éc hiÖp ®éc", 2030}, 
		[21] = {"Ngò §éc tµ ®éc", 2130}, 
	}
	
	local tbUpgradeTypes =
	{
		[1] = {"Mò", 103},
		[2] = {"Th­îng Y", 100},
		[3] = {"H¹ Y", 101},
		[4] = {"Trang Søc 1", 102},
		[5] = {"Trang Søc 2", 102},
	}
	
	-- X¸c ®Þnh sè G, D, P ®Ó add item
	local nPRoute = GetPlayerRoute()
	local nG = 0
	local nD = tbUpgradeTypes[nUpgradeType][2]
	local nP = tbShimen4Equip[nPRoute][2] + GetBody()
	if nUpgradeType == 5 then
		nP = nP + 4
	end
	if nPRoute == 8 or nPRoute == 9 then
		nP = nP - 2
	end
	
	local szEquipmentName = tbUpgradeTypes[nUpgradeType][1].." s­ m«n cÊp 4 m«n ph¸i "..tbShimen4Equip[nPRoute][1]
	--SetTask(336, GetTask(336) - 2000)
	local nRec = gf_AddItemEx2({nG, nD, nP, 1, 1, -1, -1, -1, -1, -1, -1}, szEquipmentName, szHKLBLogHeader, "chÕ t¹o thµnh c«ng")
	Msg2Player("B¹n ®· nhËn ®­îc "..szEquipmentName)
	if  nRec~= 0  then
		return 1
	end
	return 0
end

-- Add trang bÞ s­ m«n level 90
function AddTrangBiSuMon4()
	local nTemp = random(1,100)
	local nNum 
	if  nTemp <= 20 then
		nNum =  1
	elseif  nTemp <= 55 then
		nNum =  2
--	elseif   nTemp <= 60 then
--		nNum =  3
--	elseif    nTemp <= 80 then
--		nNum =  4
	else
		nNum =  3
	end
	Confirm_make_shimen_tier4BKLB(nNum) -- random(1, 5)
end

--  NhËn vò khÝ bé Phi Yªn - ViÖt Yªn - §¹i ViÖt Yªn
function AddweaponFYVYDV94()
	local nPRoute = GetPlayerRoute()
	local nRand = random(1,10000)
	if nRand <=  9000 then
--		gf_AddItemEx2(tb_golden_weapon_bpy_low[nPRoute][2],tb_golden_weapon_bpy_low[nPRoute][1],szHKLBLogHeader,"NhËn Thµnh C«ng")
--		Msg2Player("B¹n ®· nhËn ®­îc "..tb_golden_weapon_bpy_low[nPRoute][1])
--	elseif  nRand <= 9799 then
		gf_AddItemEx2(tb_golden_vy_weapon[nPRoute][2],tb_golden_vy_weapon[nPRoute][1],szBKLBLogHeader,"NhËn Thµnh C«ng")
		Msg2Player("B¹n ®· nhËn ®­îc "..tb_golden_vy_weapon[nPRoute][1])
--	elseif  nRand <= 9000 then
--		AddFaction4_weapon()
	else
		gf_AddItemEx2(tb_golden_dvy_weapon[nPRoute][2],tb_golden_dvy_weapon[nPRoute][1],szBKLBLogHeader,"NhËn Thµnh C«ng")
		Msg2Player("B¹n ®· nhËn ®­îc "..tb_golden_dvy_weapon[nPRoute][1])
	end
end

-- Vò khÝ s­ m«n 4
function AddFaction4_weapon()
	local nPRoute = GetPlayerRoute()
	local nzType = GetBody()
	gf_AddItemEx2({0,tb_golden_Faction4_weapon[nPRoute][2],tb_golden_Faction4_weapon[nPRoute][3]+nzType, 1, 1, -1, -1, -1, -1, -1, -1},tb_golden_Faction4_weapon[nPRoute][1],szBKLBLogHeader,"NhËn Thµnh C«ng")
	Msg2Player("B¹n ®· nhËn ®­îc "..tb_golden_Faction4_weapon[nPRoute][1])
end
